using System;

namespace Direction2D
{
    /// <summary>
    /// “ип перечислени€, отражающий направление в 2D пространстве.
    /// </summary>
    [Flags]
    public enum Direction : byte
    {
        /// <summary>
        /// Ѕазовое значение, отражает отсутствие направлени€.
        /// ѕри приведении к векторному типу равносильно (0, 0).
        /// </summary>
        None = 0,
        /// <summary>
        /// ѕри приведении к векторному типу равносильно (0, 1).
        /// </summary>
        Up = 1,
        /// <summary>
        /// ѕри приведении к векторному типу равносильно (0, -1).
        /// </summary>
        Down = 2,
        /// <summary>
        /// ѕри приведении к векторному типу равносильно (-1, 0).
        /// </summary>
        Left = 4,
        /// <summary>
        /// ѕри приведении к векторному типу равносильно (1, 0).
        /// </summary>
        Right = 8
    }
}
